SOAP-Collection.postman_collection.json

{
	"info": {
		"_postman_id": "37180157-65fb-4881-949a-af38bf60e980",
		"name": "SOAP-Collection",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "31715086"
	},
	"item": [
		{
			"name": "SOAPNumberConversion",
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?> \r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n <soap:Body> \r\n <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n  <ubiNum>500</ubiNum>\r\n   </NumberToWords> \r\n   </soap:Body> \r\n</soap:Envelope>\r\n",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": {
					"raw": "https://www.dataaccess.com/webservicesserver/NumberConversion.wso",
					"protocol": "https",
					"host": [
						"www",
						"dataaccess",
						"com"
					],
					"path": [
						"webservicesserver",
						"NumberConversion.wso"
					]
				}
			},
			"response": []
		}
	]
}